#+title: Rust 语言圣经
#+TAGS: 忽略(i) 没太懂(c) 笔记(n)
#+TODO: TODO(t) | IGNORE(i) NOTE(n!/@) FINISH(f)

**** NOTE [[file:basic/result-error/panic.md][panic! 深入剖析]]
CLOSED: [2024-05-19 Sun 20:18]
:LOGBOOK:
- State "NOTE"       from "TODO"       [2024-05-19 Sun 20:18]
:END:

在 Rust 中，可以使用标准库中的 std::panic 模块提供的 catch_unwind 函数来捕获 panic。这个函数会捕获传
给它的闭包中发生的 panic，并返回一个 Result。如果闭包没有 panic，那么返回的 Result 就是 Ok，其中包含
了闭包的返回值。如果闭包 panic 了，那么返回的 Result 就是 Err，其中包含了 panic 的信息。

#+begin_src rustic
  use std::panic::{self, AssertUnwindSafe};

  fn main() {
      let result = panic::catch_unwind(AssertUnwindSafe(|| {

          println!("hello!");
          let v=vec![1,2,3];
          v[99];
          println!("goodbye!");
      }));

      match result {
          Ok(_) => println!("执行成功"),
          Err(err) => println!("捕获到 panic: {:?}", err),
      }

      println!("panic 之后继续执行");
  }
#+end_src

#+RESULTS:
: hello!
: thread 'main' panicked at src/main.rs:9:10:
: index out of bounds: the len is 3 but the index is 99
: note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace
: 捕获到 panic: Any { .. }
: panic 之后继续执行

debug 和 release 末实现都可以定义 panic 时的行为

#+begin_src toml
  [profile.release]
  panic = 'abort'
#+end_src

可以自定义 panic 时的处理函数 https://doc.rust-lang.org/std/panic/fn.set_hook.html

panic 还有一些比较深入的处理过程, 参考秘典之类的书籍

